Repository: a-bentofreire/renametoix
Catalog: l10n/*.po
Languages: de, pt, ru

source: %d files renamed
de: %d Dateien umbenannt
pt: %d ficheiros renomeados
ru: %d файлов переименовано

source: %s doesn't exists
de: %s existiert nicht
pt: %s não existe
ru: %s не существует

source: About
de: Info
pt: Sobre
ru: О программе

source: Add Files
de: Dateien hinzufügen
pt: Adicionar ficheiros
ru: Добавить файлы

source: Adds Macro to Replace field
de: Fügt Makro zum Ersetzen-Feld hinzu
pt: Adiciona Macro no campo Substituir
ru: Добавляет макрос в поле замены

source: After
de: Nachher
pt: Depois
ru: После

source: Are you sure want to execute %s?
de: Möchten Sie %s wirklich ausführen?
pt: Tem a certeza que quer executar %s?
ru: Вы уверены, что хотите выполнить %s?

source: Before
de: Vorher
pt: Antes
ru: До

source: Cancel
de: Abbrechen
pt: Cancelar
ru: Отмена

source: Close
de: Schließen
pt: Fechar
ru: Закрыть

source: Console Mode
de: Konsolenmodus
pt: Modo de Consola
ru: Консольный режим

source: Execute
de: Ausführen
pt: Executar
ru: Выполнить

source: File Renamer
de: Dateiumbenenner
pt: Renomeador de ficheiros
ru: Переименовыватель файлов

source: Files
de: Dateien
pt: Ficheiros
ru: Файлы

source: Find
de: Suchen
pt: Procurar
ru: Найти

source: Generates a revert script
de: Generiert ein Rückgängig-Skript
pt: Gera um script de reversão
ru: Создает скрипт для отмены изменений

source: Help
de: Hilfe
pt: Ajuda
ru: Справка

source: Include Ext
de: Erw einschließen
pt: Incluir Ext
ru: Включить расширение

source: Integrate
de: Integrieren
pt: Integrar
ru: Интегрировать

source: Integrations
de: Integrationen
pt: Integrações
ru: Интеграции

source: Latest Revert
de: Letzte Rückgängig-Funktion
pt: Reversão mais recente
ru: Последняя отмена

source: Macro
de: Makro
ru: Макрос

source: Macros
de: Makros
ru: Макросы

source: Nautilus Script
de: Nautilus-Skript
ru: Скрипт для Nautilus

source: Nemo Action
de: Nemo-Aktion
pt: Ação Nemo
ru: Действие для Nemo

source: Nemo Integrated Rename
de: Integriertes Umbenennen in Nemo
pt: Renomeação Nemo Integrada
ru: Интегрированное переименование в Nemo

source: No
de: Nein
pt: Não
ru: Нет

source: No Files
de: Keine Dateien
pt: Sem ficheiros
ru: Нет файлов

source: Notification
de: Benachrichtigung
pt: Notificação
ru: Уведомление

source: Open
de: Ordner
pt: Abrir
ru: Открыть

source: Open Folder
de: Ordner öffnen
pt: Abrir Pasta
ru: Открыть папку

source: Outputs only the new result, doesn't rename
de: Gibt nur das neue Ergebnis aus, benennt nicht um
pt: Saída apenas o novo resultado, não renomea
ru: Выводит только новый результат, не переименовывая

source: Path
de: Pfad
pt: Trilha
ru: Путь

source: Regular Expression
de: Regulärer Ausdruck
pt: Expressão Regular
ru: Регулярное выражение

source: Renames files and directories
de: Benennt Dateien und Verzeichnisse um
pt: Renomeia ficheiros e diretórios
ru: Переименовывает файлы и директории

source: Renames including the file extension
de: Benennt einschließlich der Dateierweiterung um
pt: Renomeia incluindo a extensão do ficheiro
ru: Переименовывает, включая расширение файла

source: Replace
de: Ersetzen
pt: Substituir
ru: Заменить

source: Revert
de: Rückgängig
pt: Reverter
ru: Отменить

source: Revert Path
de: Pfad rückgängig machen
pt: Trilha para Reverter
ru: Отменить путь

source: Reverts last rename and exits
de: Macht letzte Umbenennung rückgängig und beendet
pt: Reverte o último renomeamento e termina
ru: Отменяет последнее переименование и завершает работу

source: Reverts previous renames
de: Macht vorherige Umbenennungen rückgängig
pt: Reverte renomeações anteriores
ru: Отменяет предыдущие переименования

source: Settings
de: Einstellungen
pt: Configurações
ru: Настройки

source: Start
pt: Iniciar
ru: Начать

source: Start index used with there is a %0n macro
de: Startindex wird verwendet, wenn ein %0n-Makro vorhanden ist
pt: Índice inicial utilizado com uma macro %0n
ru: Начальный индекс используется при наличии макроса %0n

source: Text to Find
de: Zu suchender Text
pt: Texto para encontrar
ru: Текст для поиска

source: Text to Replace
de: Zu ersetzender Text
pt: Texto para substituir
ru: Текст для замены

source: Thunar Action
de: Thunar-Aktion
pt: Ação Thunar
ru: Действие для Thunar

source: Uses regular expressions on the find field
de: Verwendet reguläre Ausdrücke im Suchfeld
pt: Utiliza expressões regulares no campo de Procurar
ru: Использует регулярные выражения в поле поиска

source: Yes
de: Ja
pt: Sim
ru: Да

source: Error
de: Fehler
pt: Erro
ru: Ошибка

source: Already exists
de: Existiert bereits
pt: Já existe
ru: Уже существует

source: Empty
de: Leer
pt: Vazio
ru: Пусто

source: Not changed
de: Nicht geändert
pt: Não alterado
ru: Не изменено

source: Renamed
de: Umbenannt
pt: Renomeado
ru: Переименовано

source: Moves Up
de: Nach oben verschieben
pt: Mover para cima
ru: Переместить вверх

source: Moves Down
de: Nach unten verschieben
pt: Mover para baixo
ru: Переместить вниз

source: Conflicts with file
de: Konflikte mit Datei
pt: Conflitos com o ficheiro
ru: Конфликтует с файлом

source: Sequential number padded to 1 digit (e.g., 1, 2, 3…)
de: Sequenznummer auf 1 Stelle aufgefüllt (z. B. 1, 2, 3…)
pt: Número sequencial preenchido com 1 dígito (ex.: 1, 2, 3…)
ru: Последовательный номер с заполнением до 1 цифры (например, 1, 2, 3…)

source: Sequential number padded to 2 digits (e.g., 01, 02, 03…)
de: Sequenznummer auf 2 Stellen aufgefüllt (z. B. 01, 02, 03…)
pt: Número sequencial preenchido com 2 dígitos (ex.: 01, 02, 03…)
ru: Последовательный номер с заполнением до 2 цифр (например, 01, 02, 03…)

source: Sequential number padded to 3 digits (e.g., 001, 002, 003…)
de: Sequenznummer auf 3 Stellen aufgefüllt (z. B. 001, 002, 003…)
pt: Número sequencial preenchido com 3 dígitos (ex.: 001, 002, 003…)
ru: Последовательный номер с заполнением до 3 цифр (например, 001, 002, 003…)

source: File's last modification date in format YYYY-MM-DD
de: Letztes Änderungsdatum der Datei im Format JJJJ-MM-TT
pt: Data da última modificação do ficheiro no formato AAAA-MM-DD
ru: Дата последнего изменения файла в формате ГГГГ-ММ-ДД

source: File's last modification date and time in format YYYY-MM-DD-HH_MM_SS
de: Letztes Änderungsdatum und Uhrzeit der Datei im Format JJJJ-MM-TT-HH_MM_SS
pt: Data e hora da última modificação do ficheiro no formato AAAA-MM-DD-HH_MM_SS
ru: Дата и время последнего изменения файла в формате ГГГГ-ММ-ДД-ЧЧ_ММ_СС

source: File's last modification date and time in format YYYY-MM-DD HH_MM_SS
de: Letztes Änderungsdatum und Uhrzeit der Datei im Format JJJJ-MM-TT HH_MM_SS
pt: Data e hora da última modificação do ficheiro no formato AAAA-MM-DD HH_MM_SS
ru: Дата и время последнего изменения файла в формате ГГГГ-ММ-ДД ЧЧ_ММ_СС

source: First regex group converted to UPPERCASE
de: Erste Regex-Gruppe in GROSSBUCHSTABEN umgewandelt
pt: Primeiro grupo de regex convertido em MAIÚSCULAS
ru: Первая группа regex преобразована в ВЕРХНИЙ РЕГИСТР

source: First regex group converted to lowercase
de: Erste Regex-Gruppe in Kleinbuchstaben umgewandelt
pt: Primeiro grupo de regex convertido em minúsculas
ru: Первая группа regex преобразована в нижний регистр

source: First regex group Capitalized
de: Erste Regex-Gruppe mit Großbuchstabe am Anfang
pt: Primeiro grupo de regex com Inicial Maiúscula
ru: Первая группа regex с Заглавной Буквой

source: Second regex group converted to UPPERCASE
de: Zweite Regex-Gruppe in GROSSBUCHSTABEN umgewandelt
pt: Segundo grupo de regex convertido em MAIÚSCULAS
ru: Вторая группа regex преобразована в ВЕРХНИЙ РЕГИСТР

source: Second regex group converted to lowercase
de: Zweite Regex-Gruppe in Kleinbuchstaben umgewandelt
pt: Segundo grupo de regex convertido em minúsculas
ru: Вторая группа regex преобразована в нижний регистр

source: Second regex group Capitalized
de: Zweite Regex-Gruppe mit Großbuchstabe am Anfang
pt: Segundo grupo de regex com Inicial Maiúscula
ru: Вторая группа regex с Заглавной Буквой

source: Evaluate Python expression with regex match groups (e.g., m[0] = full match)
de: Python-Ausdruck mit Regex-Gruppen auswerten (z. B. m[0] = vollständiger Treffer)
pt: Avalia expressão Python com grupos regex (ex.: m[0] = correspondência completa)
ru: Вычислить выражение Python с группами regex (например, m[0] = полное совпадение)

source: Insert geographic metadata from plugin (country and city)
de: Geografische Metadaten aus Plugin einfügen (Land und Stadt)
pt: Insere metadados geográficos do plugin (país e cidade)
ru: Вставить географические метаданные из плагина (страна и город)

source: Insert document metadata from plugin (header field)
de: Dokument-Metadaten aus Plugin einfügen (Header-Feld)
pt: Insere metadados do documento do plugin (campo header)
ru: Вставить метаданные документа из плагина (поле заголовка)

source: Original filename without extension
de: Ursprünglicher Dateiname ohne Erweiterung
pt: Nome original do ficheiro sem extensão
ru: Исходное имя файла без расширения

source: Original file extension (including dot, e.g., .txt)
de: Ursprüngliche Dateierweiterung (einschließlich Punkt, z. B. .txt)
pt: Extensão original do ficheiro (incluindo ponto, ex.: .txt)
ru: Исходное расширение файла (включая точку, напр. .txt)
